In [2]:
#q.1
#1.data.head()
#2.data.tail()
#3.DataFrame.info()
#4.Dtypes
##5.data.shape
#6.data.csv

In [4]:
import pandas as pd

In [7]:
#q.2
data=({'a':['v','r','s','m'],
      'b':[18,45,25,7],
      'c':[230,250,180,300],
      'd':[12,15,8,5]
     })

In [11]:
df=pd.DataFrame(data)

In [12]:
df

   a   b    c   d
0  v  18  230  12
1  r  45  250  15
2  s  25  180   8
3  m   7  300   5

In [21]:
df1=pd.DataFrame(data,index=['A','B','C','D'])

In [24]:
df1

   a   b    c   d
A  v  18  230  12
B  r  45  250  15
C  s  25  180   8
D  m   7  300   5

In [30]:
df.set_index("a",inplace=True)

In [31]:
df=df.reset_index()

In [32]:
df

   a   b    c   d
0  v  18  230  12
1  r  45  250  15
2  s  25  180   8
3  m   7  300   5

In [33]:
df1.reindex([1,3,5,7])

  index    a     b      c     d
1     B    r  45.0  250.0  15.0
3     D    m   7.0  300.0   5.0
5   NaN  NaN   NaN    NaN   NaN
7   NaN  NaN   NaN    NaN   NaN

In [35]:
#q.3
data=({'values':[30,40,50,60,90]
})

In [45]:
pd.DataFrame(data)

   values
0      30
1      40
2      50
3      60
4      90

In [39]:
for values in df.iterrows():
    print(values)

(0, values    30
Name: 0, dtype: int64)
(1, values    40
Name: 1, dtype: int64)
(2, values    50
Name: 2, dtype: int64)
(3, values    60
Name: 3, dtype: int64)
(4, values    90
Name: 4, dtype: int64)

In [48]:
def test(x):
    return x.sum()
    df.apply(test,axis=0)

In [60]:
#q.4
pd.set_option("display.max_colwidth",100)
df=pd.DataFrame({'text':["Ethical hacking is a process of detecting vulnerabilities in an application, system, or organization's infrastructure that an attacker can use to exploit an individual or organization. They use this process to prevent cyberattacks and security breaches by lawfully hacking into the systems and looking for weak points."]})

In [61]:
df["word_count"]=df['text'].apply(lambda x:len(x.split()))

In [62]:
df

,text,word_count
0,"Ethical hacking is a process of detecting vulnerabilities in an application, system, or organiza...",47

In [63]:
#q.5
#The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

#df.size:
#The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame

In [64]:
#q.6
#pd.read_xlsx(" ".xlsx)

In [88]:
#q.7 
data1=({'email':["rahul.j@domain.com","ram@domain.com","joe.g@domain.com"]})

In [84]:
df=pd.DataFrame(data1)

In [85]:
username=['rahul.j','ram','joe.j']

In [86]:
df['username']=username

In [87]:
print(df)

                email username
0  rahul.j@domain.com  rahul.j
1      ram@domain.com      ram
2    joe.g@domain.com    joe.j

In [97]:
#q.9
data=({'name':['rahul','shyam','aryan','krishns'],
       'age':[18,19,19,20],
       'id':[201,202,203,204]
      })

In [91]:
df=pd.DataFrame(data)

In [92]:
df['age'].mean()

19.0

In [93]:
df

      name  age   id
0    rahul   18  201
1    shyam   19  202
2    aryan   19  203
3  krishns   20  204

In [94]:
df['age'].median()

19.0

In [96]:
df['age'].std()

0.816496580927726

In [98]:
#q.11
data=({'date':['2023-3-1','2023-3-2','2023-3-3','2023-3-4']
      })

In [100]:
df1=pd.DataFrame(data)

In [101]:
weekday=['monday','tuesday','wednesday','thursday']

In [102]:
df1['weekday']=weekday

In [103]:
df1

       date    weekday
0  2023-3-1     monday
1  2023-3-2    tuesday
2  2023-3-3  wednesday
3  2023-3-4   thursday

In [114]:
#q.12
date=pd.date_range(start='2023-01-01',end='2023-01-31')

In [105]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [106]:
dt=pd.Timedelta(days=31,hours=4,minutes=00)

In [107]:
dt

Timedelta('31 days 04:00:00')

In [109]:
dt=pd.to_datetime('2023-01-01')

In [110]:
dt

Timestamp('2023-01-01 00:00:00')

In [111]:
td=pd.Timedelta(days=31)

In [112]:
td

Timedelta('31 days 00:00:00')

In [113]:
td+date

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-04',
               '2023-02-05', '2023-02-06', '2023-02-07', '2023-02-08',
               '2023-02-09', '2023-02-10', '2023-02-11', '2023-02-12',
               '2023-02-13', '2023-02-14', '2023-02-15', '2023-02-16',
               '2023-02-17', '2023-02-18', '2023-02-19', '2023-02-20',
               '2023-02-21', '2023-02-22', '2023-02-23', '2023-02-24',
               '2023-02-25', '2023-02-26', '2023-02-27', '2023-02-28',
               '2023-03-01', '2023-03-02', '2023-03-03'],
              dtype='datetime64[ns]', freq='D')

In [115]:
#q.13
#To use the basic functions of pandas, what is the first and foremost necessary library that needs to import numpy and matplotlib for data visualization

In [116]:
#q.10
data=({'sales':[34,45,67,78,45,50,54],
       'date':['2023-04-20','2023-04-21','2023-04-22','2023-04-23','2023-04-24','2023-04-25','2023-04-26']
      })

In [118]:
df4=pd.DataFrame(data)

In [119]:
MovingAverage=[34,45,46,47,49,50,48]

In [120]:
df4['MovingAverage']=MovingAverage

In [121]:
df4

   sales        date  MovingAverage
0     34  2023-04-20             34
1     45  2023-04-21             45
2     67  2023-04-22             46
3     78  2023-04-23             47
4     45  2023-04-24             49
5     50  2023-04-25             50
6     54  2023-04-26             48

In [127]:
df4['MovingAverage'].rolling(window=1).mean()

0    34.0
1    45.0
2    46.0
3    47.0
4    49.0
5    50.0
6    48.0
Name: MovingAverage, dtype: float64

In [128]:
df4['MovingAverage'].rolling(window=7).mean()

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6    45.571429
Name: MovingAverage, dtype: float64

In [1]:
import pandas as pd

In [11]:
#Q.8
data=({'A':[5,6,7,8],
       'B':[9,5,7,6],
       'C':[11,12,13,14]
      })

In [4]:
df=pd.DataFrame(data)

In [5]:
df

   A  B   C
0  5  9  11
1  6  5  12
2  7  7  13
3  8  6  14

In [10]:
df[0::2]

   A  B   C
0  5  9  11
2  7  7  13